---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RiserCurveTooShort
source: html/c160b04d-f8ff-e91e-d4fe-187072f4765c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RiserCurveTooShort Property

Riser curve is too short to create nosing on it.

## Syntax (C#)
```csharp
public static FailureDefinitionId RiserCurveTooShort { get; }
```